Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: The parameter *`action`* represents the [action](../gmock_for_dummies.md#actions-what-should-it-do) that the function call will perform.
it_it: Il parametro *`action`* rappresenta la [action](../gmock_for_dummies.md#actions-what-should-it-do) che la chiamata alla funzione eseguirà.

source: The parameter *`cardinality`* represents the number of expected calls and can be one of the following, all defined in the `::testing` namespace:
it_it: Il parametro *`cardinality`* rappresenta il numero di chiamate previste e può essere uno dei seguenti, tutti definiti nel namespace `::testing`:

source: The parameter *`expectations...`* can be up to five [`Expectation`](#Expectation) or [`ExpectationSet`](#ExpectationSet) objects.
it_it: Il parametro *`expectations...`* può contenere fino a cinque oggetti [`Expectation`](#Expectation) o [`ExpectationSet`](#ExpectationSet).

source: The parameter *`matcher`* is either a [matcher](matchers.md) for a `const std::string&`, or a regular expression (see [Regular Expression Syntax](../advanced.md#regular-expression-syntax))—a bare string *`s`* (with no matcher) is treated as [`ContainsRegex(s)`](matchers.md#string-matchers), **not** [`Eq(s)`](matchers.md#generic-comparison).
it_it: Il parametro *`matcher`* è un [matcher](matchers.md) per una `const std::string&`, o un'espressione regolare (consultare [Sintassi delle Espressioni Regolari](../advanced.md#regular-expression-syntax))—una stringa semplice *`s`* (senza matcher) viene trattata come [`ContainsRegex(s)`](matchers.md#string-matchers), **non** [`Eq(s)`](matchers.md#generic-comparison).

source: The parameter *`matchers...`* is a comma-separated list of [matchers](../gmock_for_dummies.md#matchers-what-arguments-do-we-expect) that correspond to each argument of the method *`method_name`*.
it_it: Il parametro *`matchers...`* è un elenco separato da virgole di [matcher](../gmock_for_dummies.md#matchers-what-arguments-do-we-expect) che corrispondono a ciascun argomento del metodo *`method_name`*.

source: The parameter *`multi_argument_matcher`* must thus be a matcher of type `Matcher<std::tuple<A1, ..., An>>`, where `A1, ..., An` are the types of the function arguments.
it_it: Il parametro *`multi_argument_matcher`* deve quindi essere un matcher di tipo `Matcher<std::tuple<A1, ..., An>>`, dove `A1, ..., An` sono i tipi degli argomenti della funzione.

source: The parameter *`pred_formatter`* is a *predicate-formatter*, which is a function or functor with the signature:
it_it: Il parametro *`pred_formatter`* è un *predicate-formatter*, che è una funzione o un funtore con la firma:

source: The parameter *`pred`* is a function or functor that accepts as many arguments as the corresponding macro accepts values.
it_it: Il parametro *`pred`* è una funzione o un funtore che accetta tanti argomenti quanti sono i valori accettati dalla macro corrispondente.

source: The parameter *`predicate`* is a function or functor that accepts an `int` exit status and returns a `bool`.
it_it: Il parametro *`predicate`* è una funzione o un funtore che accetta uno stato di uscita `int` e restituisce un `bool`.

source: The parameter *`sequences...`* is any number of [`Sequence`](#Sequence) objects.
it_it: Il parametro *`sequences...`* è un numero qualsiasi di oggetti [`Sequence`](#Sequence).

source: The parameter action represents the action that the function call will perform.
it_it: Il parametro action rappresenta la action che la chiamata alla funzione eseguirà.

source: The parameter cardinality represents the number of expected calls and can be one of the following, all defined in the ::testing namespace:
it_it: Il parametro cardinality rappresenta il numero di chiamate previste e può essere uno dei seguenti, tutti definiti nel namespace ::testing:

source: The parameter expectations... can be up to five Expectation or ExpectationSet objects.
it_it: Il parametro expectations... può contenere fino a cinque oggetti Expectation o ExpectationSet.

source: The parameter matcher is either a matcher for a const std::string&, or a regular expression (see Regular Expression Syntax)—a bare string s (with no matcher) is treated as ContainsRegex(s), not Eq(s).
it_it: Il parametro matcher è un matcher per una const std::string&, o un'espressione regolare (consultare Sintassi delle Espressioni Regolari)—una stringa semplice s (senza matcher) viene trattata come ContainsRegex(s), non Eq(s).

source: The parameter matchers... is a comma-separated list of matchers that correspond to each argument of the method method_name.
it_it: Il parametro matchers... è un elenco separato da virgole di matchers che corrispondono a ciascun argomento del metodo method_name.

source: The parameter pred is a function or functor that accepts as many arguments as the corresponding macro accepts values.
it_it: Il parametro pred è una funzione o un funtore che accetta tanti argomenti quanti sono i valori accettati dalla macro corrispondente.

source: The parameter pred_formatter is a predicate-formatter, which is a function or functor with the signature:
it_it: Il parametro pred_formatter è un predicate-formatter, che è una funzione o un funtore con la firma:

source: The parameter predicate is a function or functor that accepts an int exit status and returns a bool.
it_it: Il parametro predicate è una funzione o un funtore che accetta uno stato di uscita int e restituisce un bool.

source: The parameter sequences... is any number of Sequence objects.
it_it: Il parametro sequences... è un numero qualsiasi di oggetti Sequence.

source: The parameter generator expression is not evaluated until GoogleTest is initialized (via InitGoogleTest()).
it_it: L'espressione del generatore di parametri non viene valutata finché GoogleTest non viene inizializzato (tramite InitGoogleTest()).

source: The parameter generator expression is not evaluated until GoogleTest is initialized (via `InitGoogleTest()`).
it_it: L'espressione del generatore di parametri non viene valutata finché GoogleTest non viene inizializzato (tramite `InitGoogleTest()`).

source: The parameters of MOCK_METHOD mirror the method declaration.
it_it: I parametri di MOCK_METHOD riflettono la dichiarazione del metodo.

source: The parameters of `MOCK_METHOD` mirror the method declaration.
it_it: I parametri di `MOCK_METHOD` riflettono la dichiarazione del metodo.

source: The preferred API is *TestSuite*.
it_it: L'API preferita è *TestSuite*.

source: The preferred API is TestSuite.
it_it: L'API preferita è TestSuite.

source: The previous recipe showed you how to define your own action.
it_it: La ricetta precedente ha mostrato come definire una propria azione.

source: The problem is that in general, there is *no way* for a mock object to know how many arguments are passed to the variadic method, and what the arguments' types are.
it_it: Il problema è che, in generale, non c'è *nessun modo* per un oggetto mock di sapere quanti argomenti vengono passati al metodo variadico e quali sono i tipi degli argomenti.

source: The problem is that in general, there is no way for a mock object to know how many arguments are passed to the variadic method, and what the arguments' types are.
it_it: Il problema è che, in generale, non c'è nessun modo per un oggetto mock di sapere quanti argomenti vengono passati al metodo variadico e quali sono i tipi degli argomenti.

source: The problem is that, as we said, expectations are sticky.
it_it: Il problema è che, come abbiamo detto, le expectation sono appiccicose.

source: The problem, is that they didn't pick the **best** way to express the test's intent.
it_it: Il problema è che non hanno scelto il modo **migliore** per esprimere l'intento del test.

source: The problem, is that they didn't pick the best way to express the test's intent.
it_it: Il problema è che non hanno scelto il modo migliore per esprimere l'intento del test.

source: The pure interface class that all value-parameterized tests inherit from.
it_it: La classe di interfaccia pura da cui ereditano tutti i test valori parametrizzati.

source: The quality of those manually written mocks is a bit, uh, unpredictable.
it_it: La qualità di questi mock scritti manualmente è un po', ehm, imprevedibile.

source: The rationale for this design is that the automated testing service determines whether a test has passed based on its exit code, not on its stdout/stderr output; thus your main() function must return the value of RUN_ALL_TESTS().
it_it: La logica di questa progettazione è che il servizio di test automatizzato determina se un test è stato superato in base al suo codice di uscita, non all'output stdout/stderr; quindi la funzione main() deve restituire il valore di RUN_ALL_TESTS().

source: The rationale for this design is that the automated testing service determines whether a test has passed based on its exit code, not on its stdout/stderr output; thus your `main()` function must return the value of `RUN_ALL_TESTS()`.
it_it: La logica di questa progettazione è che il servizio di test automatizzato determina se un test è stato superato in base al suo codice di uscita, non all'output stdout/stderr; quindi la funzione `main()` deve restituire il valore di `RUN_ALL_TESTS()`.

source: The reason for the two death test styles has to do with thread safety.
it_it: Il motivo dei due stili di death test ha a che fare con la "thread safety".

source: The reason is that Return(*value*) converts value to the actual return type of the mock function at the time when the action is created, not when it is executed.
it_it: Il motivo è che Return(*value*) converte value nel tipo restituito effettivo della funzione mock nel momento in cui l'azione viene creata, non quando viene eseguita.

source: The reason is that `Return(*value*)` converts `value` to the actual return type of the mock function at the time when the action is *created*, not when it is *executed*.
it_it: Il motivo è che `Return(*value*)` converte `value` nel tipo restituito effettivo della funzione mock nel momento in cui l'azione viene *creata*, non quando viene *eseguita*.

source: The reason is that this allows a user to set up the default expectations in a mock object's constructor or the test fixture's set-up phase and then customize the mock by writing more specific expectations in the test body.
it_it: Il motivo è che ciò consente all'utente di impostare le expectation di default nel costruttore di un oggetto mock o nella fase di impostazione del [test fixture] e quindi personalizzare il mock expectation più specifiche nel corpo del test.

source: The related term *Test*, as it is used in GoogleTest, corresponds to the term *[Test Case][istqb test case]* of ISTQB and others.
it_it: Il termine correlato *Test*, così come viene utilizzato in GoogleTest, corrisponde al termine *[Test Case][istqb test case]* di ISTQB e di altri.

source: The related term Test, as it is used in GoogleTest, corresponds to the term Test Case of ISTQB and others.
it_it: Il termine correlato Test, così come viene utilizzato in GoogleTest, corrisponde al termine Test Case di ISTQB e di altri.

source: The remainder of this section should only apply when you need to do something custom before the tests run that cannot be expressed within the framework of fixtures and test suites.
it_it: Il resto di questa sezione dovrebbe applicarsi solo quando è necessario fare qualcosa di personalizzato prima dell'esecuzione dei test che non possa essere espresso nell'ambito delle fixture e delle test suite.

source: The report contains the duration of each test, and thus can help you identify slow tests.
it_it: Il report contiene la durata di ciascun test e quindi può aiutare a identificare i test lenti.

source: The report format conforms to the following JSON Schema:
it_it: Il formato del report è conforme al seguente schema JSON:

source: The report is based on the junitreport Ant task.
it_it: Il report si basa sul task Ant junitreport.

source: The report is based on the `junitreport` Ant task.
it_it: Il report si basa sul task Ant `junitreport`.

source: The report uses the format that conforms to the following Proto3 using the JSON encoding:
it_it: Il report utilizza il formato conforme al seguente Proto3 utilizzando la codifica JSON:

source: The report uses the format that conforms to the following Proto3 using the [JSON encoding](https://developers.google.com/protocol-buffers/docs/proto3#json):
it_it: Il report utilizza il formato conforme al seguente Proto3 utilizzando la [codifica JSON](https://developers.google.com/protocol-buffers/docs/proto3#json):

source: The result of this predicate is true only if the program exits with the same exit_code mentioned in the predicate.
it_it: Il risultato di questo predicato è vero solo se il programma termina con lo stesso exit_code menzionato nel predicato.

source: The resulting trace includes the given source file path and line number, and the given message.
it_it: Il trace risultante include il path del file sorgente e il numero di riga specificati, nonché il messaggio specificato.

source: The return type Type is an enum defined as follows:
it_it: Il tipo restituito Type è un enum definito come segue:

source: The return type `Type` is an enum defined as follows:
it_it: Il tipo restituito `Type` è un enum definito come segue:

source: The return type of the mock function
it_it: Il tipo restituito della funzione mock

source: The return value of the invoked function is used as the return value of the action.
it_it: Il valore restituito della funzione richiamata viene utilizzato come valore restituito dell'azione.

source: The return value of the last action **must** match the return type of the mocked method.
it_it: Il valore restituito dell'ultima azione **deve** corrispondere al tipo restituito del metodo mock-ato.

source: The return value of the last action must match the return type of the mocked method.
it_it: Il valore restituito dell'ultima azione deve corrispondere al tipo restituito del metodo mock-ato.

source: The root <testsuites> element corresponds to the entire test program.
it_it: L'elemento root <testsuites> corrisponde all'intero programma di test.

source: The root `<testsuites>` element corresponds to the entire test program.
it_it: L'elemento root `<testsuites>` corrisponde all'intero programma di test.

source: The rule is **all test methods in the same test suite must use the same fixture class**.
it_it: La regola è che **tutti i metodi dei test nella stessa test suite devono utilizzare la stessa classe fixture**.

source: The rule is all test methods in the same test suite must use the same fixture class.
it_it: La regola è che tutti i metodi dei test nella stessa test suite devono utilizzare la stessa classe fixture.

source: The rule is more constraining than necessary, but it's simple and easy to remember.
it_it: La regola è più vincolante del necessario, ma è semplice e facile da ricordare.

source: The rule is relatively simple:
it_it: La regola è relativamente semplice:

source: The rule of thumb is to use EXPECT_* when you want the test to continue to reveal more errors after the assertion failure, and use ASSERT_* when continuing after failure doesn't make sense.
it_it: La regola pratica è quella di utilizzare EXPECT_* quando si desidera che il test continui a scoprire altri errori dopo il fallimento dell'asserzione e utilizzare ASSERT_* quando continuare dopo il fallimento non ha senso.

source: The rule of thumb is to use `EXPECT_*` when you want the test to continue to reveal more errors after the assertion failure, and use `ASSERT_*` when continuing after failure doesn't make sense.
it_it: La regola pratica è quella di utilizzare `EXPECT_*` quando si desidera che il test continui a scoprire altri errori dopo il fallimento dell'asserzione e utilizzare `ASSERT_*` quando continuare dopo il fallimento non ha senso.

source: The same as AllOf() except that the matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di AllOf() tranne per il fatto che i matcher provengono da un elenco di inizializzatori, da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as AnyOf() except that the matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di AnyOf() tranne per il fatto che i matcher provengono da un elenco di inizializzatori, da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as EXPECT_THAT(actual_value, matcher), except that it generates a fatal failure.
it_it: Uguale a EXPECT_THAT(actual_value, matcher), tranne per il fatto che genera un errore fatale.

source: The same as ElementsAre() except that the expected element values/matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di ElementsAre() tranne per il fatto che gli elementi valori/matcher attesi provengono da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as Eq(container) except that the failure message also includes which elements are in one container but not the other.
it_it: Lo stesso di Eq(container) tranne per il fatto che il messaggio di errore include anche quali elementi si trovano in un contenitore ma non nell'altro.

source: The same as UnorderedElementsAre() except that the expected element values/matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di UnorderedElementsAre() tranne per il fatto che gli elementi valori/matcher attesi provengono da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as WhenSorted(m), except that the given comparator instead of < is used to sort argument.
it_it: Uguale a WhenSorted(m), tranne per il fatto che il comparatore indicato invece di < viene utilizzato per ordinare argument.

source: The same as `AllOf()` except that the matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di `AllOf()` tranne per il fatto che i matcher provengono da un elenco di inizializzatori, da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as `AnyOf()` except that the matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di `AnyOf()` tranne per il fatto che i matcher provengono da un elenco di inizializzatori, da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as `EXPECT_THAT(actual_value, matcher)`, except that it generates a **fatal** failure.
it_it: Uguale a `EXPECT_THAT(actual_value, matcher)`, tranne per il fatto che genera un errore **fatale**.

source: The same as `ElementsAre()` except that the expected element values/matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di `ElementsAre()` tranne per il fatto che gli elementi valori/matcher attesi provengono da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as `Eq(container)` except that the failure message also includes which elements are in one container but not the other.
it_it: Lo stesso di `Eq(container)` tranne per il fatto che il messaggio di errore include anche quali elementi si trovano in un contenitore ma non nell'altro.

source: The same as `UnorderedElementsAre()` except that the expected element values/matchers come from an initializer list, STL-style container, iterator range, or C-style array.
it_it: Lo stesso di `UnorderedElementsAre()` tranne per il fatto che gli elementi valori/matcher attesi provengono da una lista di inizializzatori, un contenitore in stile STL, un iteratore range o da un array in stile C.

source: The same as `WhenSorted(m)`, except that the given comparator instead of `<` is used to sort `argument`.
it_it: Uguale a `WhenSorted(m)`, tranne per il fatto che il comparatore indicato invece di `<` viene utilizzato per ordinare `argument`.

source: The same as the two-parameter version, but provides a better error message.
it_it: Uguale alla versione a due parametri, ma fornisce un messaggio di errore migliore.

source: The same code compiles fine with gcc, for example.
it_it: Lo stesso codice viene compilato bene con gcc, ad esempio.

source: The same is true when you use matchers like Eq(bar), Le(bar), and so on.
it_it: Lo stesso vale quando si usano matcher come Eq(bar), Le(bar) e così via.

source: The same is true when you use matchers like `Eq(bar)`, `Le(bar)`, and so on.
it_it: Lo stesso vale quando si usano matcher come `Eq(bar)`, `Le(bar)` e così via.

source: The same recommendation goes for using _LDFLAGS over the more commonplace _LIBRARIES, which happens to discard -L flags and -pthread.
it_it: La stessa raccomandazione vale per l'utilizzo di _LDFLAGS al posto del più comune _LIBRARIES, che scarta i flag -L e -pthread.

source: The same recommendation goes for using `_LDFLAGS` over the more commonplace `_LIBRARIES`, which happens to discard `-L` flags and `-pthread`.
it_it: La stessa raccomandazione vale per l'utilizzo di `_LDFLAGS` al posto del più comune `_LIBRARIES`, che scarta i flag `-L` e `-pthread`.

source: The same test fixture is not used across multiple tests.
it_it: La stessa fixture non viene utilizzata per più test.

source: The seed value 0 is special: it tells GoogleTest to do the default behavior of calculating the seed from the current time.
it_it: Il valore seed 0 è speciale: indica a GoogleTest di eseguire il comportamento di default di calcolare il seed dall'ora corrente.

source: The signature of the callable is Fixture*(), where Fixture is the test fixture class for the test.
it_it: La firma del richiamabile è Fixture*(), dove Fixture è la classe fixture per il test.

source: The signature of the callable is `Fixture*()`, where `Fixture` is the test fixture class for the test.
it_it: La firma del richiamabile è `Fixture*()`, dove `Fixture` è la classe fixture per il test.

source: The sole EXPECT_CALL here says that all calls to GetDomainOwner() must have "google.com" as the argument.
it_it: L'unico EXPECT_CALL qui dice che tutte le chiamate a GetDomainOwner() devono avere "google.com" come argomento.

source: The sole `EXPECT_CALL` here says that all calls to `GetDomainOwner()` must have `"google.com"` as the argument.
it_it: L'unico `EXPECT_CALL` qui dice che tutte le chiamate a `GetDomainOwner()` devono avere `"google.com"` come argomento.

source: The standard technique is to add a "catch all" EXPECT_CALL:
it_it: La tecnica standard consiste nell'aggiungere un "acchiappa-tutto" EXPECT_CALL:

source: The standard technique is to add a "catch all" `EXPECT_CALL`:
it_it: La tecnica standard consiste nell'aggiungere un "acchiappa-tutto" `EXPECT_CALL`:

source: The statements within the test body can be any code under test.
it_it: Le istruzioni all'interno del corpo del test possono essere qualsiasi codice da testare.

source: The syntax for mocking non-virtual methods is the *same* as mocking virtual methods (just don't add `override`):
it_it: La sintassi per il mock dei metodi non-virtual è la *stessa* dei mock dei metodi virtual (basta non aggiungere `override`):

source: The syntax for mocking non-virtual methods is the same as mocking virtual methods (just don't add override):
it_it: La sintassi per il mock dei metodi non-virtual è la stessa dei mock dei metodi virtual (basta non aggiungere override):
